---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotation.TagId
source: html/33f7bb8b-f277-0eee-e7ec-69c53e2d21e1.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotation.TagId Property

The child IndependentTag owned by this multi-reference annotation.

## Syntax (C#)
```csharp
public ElementId TagId { get; }
```